# running in prove_yosys/src/
read -formal moore.v
prep -top moore

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
