# running in cover_yosys/src/
read -formal mealy.v
prep -top mealy

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
